package domain.mock

import domain.models.Question

/*
    mock question for testing
 */
val mockQuestion = listOf(
    Question(
        image = "https://web.testpdr.com/storage/questions/QNS_3908.jpg",
        title = "Документи, які повинен пред`явити для перевірки водій на вимогу поліцейського:",
        variants = listOf(
            "Посвідчення на право керування транспортним засобом відповідної категорії і реєстраційний документ на транспортний засіб.",
            "Поліс (сертифікат) обов'язкового страхування цивільно-правової відповідальності власників наземних транспортних засобів (крім водіїв, які відповідно до законодавства звільняються від обов’язкового страхування цивільно-правової відповідальності власників наземних транспортних засобів на території України).",
            "Медична довідка.",
            "Відповіді 1, 2 і 3.",
        ),
        resultId = 4,
        description = "ПДР 2.4.\nНа вимогу поліцейського водій повинен зупинитися з дотриманням вимог цих Правил, а також:\r\nа)  пред'явити для перевірки документи, зазначені в пункті 2.1; 2.1. Водій механічного транспортного засобу повинен мати при собі: \r\nа)  посвідчення водія на право керування транспортним засобом відповідної категорії;\r\nб)  реєстраційний документ на транспортний засіб;\r\nґ)  поліс (сертифікат) обов'язкового страхування цивільно-правової відповідальності власників наземних транспортних засобів.",
    ),
    Question(
        image = "https://web.testpdr.com/storage/questions/QNS_5625.jpg",
        title = "На яких транспортних засобах встановлюється такий розпізнавальний знак?",
        variants = listOf(
            "На тих, якими керують водії з інвалідністю.",
            "На тих, якими керують глухі або глухонімі водії.",
            "Відповіді 1 і 2."
        ),
        resultId = 1,
        description = "ПДР 30.3.\nНа відповідних транспортних засобах установлюються такі розпізнавальні знаки:\r↵ґ)  «Інвалід» - квадрат жовтого кольору і…"
    ),
    Question(
        image = "https://web.testpdr.com/storage/questions/QNS_4777.jpg",
        title = "Чи дозволено Вам рух прямо в зображеній ситуації?",
        variants = listOf(
            "Дозволено.",
            "Заборонено."
        ),
        resultId = 1,
        description = null
    ),
    Question(
        image = null,
        title = "У яких умовах водіям оперативних транспортних засобів дозволено використовувати фару-прожектор або фару-шукач?",
        variants = listOf(
            "Завжди в темний час доби або в умовах недостатньої видимості.",
            "Під час виконання службових завдань, вживши заходів для того, щоб не засліплювати інших учасників дорожнього руху."
        ),
        resultId = 2,
        description = "ПДР 19.6.\nФарою-прожектором і фарою-шукачем можуть користуватися лише водії оперативних транспортних засобів під час виконанн…"

    ),
    Question(
        image = null,
        title = "Сигнал, який показує регулювальник відрізняється від вимог дорожніх знаків. Дорожні знаки є пріоритетними в цьому випадку:",
        variants = listOf(
            "Так",
            "Ні"
        ),
        resultId = 2,
        description = null
    )
)
