package domain.mock

import domain.models.Point
import domain.models.Rule

/*
    mock rules for testing
 */
val mockRules = listOf(
    Rule(
        number = "1",
        title = "Загальні положення",
        points = listOf(
            Point(
                content = "Ці Правила відповідно до Закону України [«Про дорожній рух»](https://zakon.rada.gov.ua/cgi-bin/laws/main.cgi?nreg=3353-12&p=1311950448261895) встановлюють єдиний порядок дорожнього руху на всій території України.\r\n\r\nІнші нормативні акти, що стосуються особливостей дорожнього руху (перевезення спеціальних вантажів, експлуатація транспортних засобів окремих видів, рух на закритій території тощо), повинні ґрунтуватися на вимогах цих Правил.\r\n\r\n***Навчальне відео по темі \"Загальні положення\"***",
                number = "1.1",
            ),
            Point(
                content = "В Україні установлено правосторонній рух транспортних засобів.",
                number = "1.2",
            )
        )
    ),
    Rule(
        number = "3",
        title = "Рух транспортних засобів із спеціальними сигналами",
        points = listOf(
            Point(
                number = "3.1",
                content = "Водії оперативних транспортних засобів, виконуючи невідкладне службове завдання, можуть відступати від вимог наступних розділів: 8 (крім сигналів регулювальника), 10, 11, 12, 13, 14, 15, 16, 17, 18, 26, 27 та пункту 28.1 цих Правил за умови увімкнення проблискового маячка синього або червоного кольору і спеціального звукового сигналу та забезпечення безпеки дорожнього руху. За відсутності необхідності додаткового привертання уваги учасників дорожнього руху спеціальний звуковий сигнал може бути вимкнений.\n Навчальне відео по темі \"Рух транспортних засобів із спеціальними сигналами\""
            ),
            Point(
                content = "Забороняється здійснювати обгін і випередження транспортних засобів з увімкненими проблисковими маячками синього і червоного або лише червоного кольору та зеленого або синього і зеленого кольору і супроводжуваних ними транспортних засобів (колони), а також рухатися по суміжних смугах із швидкістю колони або займати місце в колоні.",
                number = "3.4",
            )
        )
    )
)
